examples/04_pimpleHFDIBFoamSettling/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  3.0.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
bodyNames ( "icoSphere" );

interpolationSchemes
{
//  U cellPointFace;
//  method line;
    U cell;
}

// fluid flow auxiliary settings
surfaceThreshold                1e-6;
nDragForceSmoothingIterations   0;
nDirectForcingIterations        10;
immersedUTolerance              1e-4;

// DEM settings
stepDEM     1;

// simulation auxiliary settings
geometricD (1 1 1);
recordSimulation true;
recordFirstTimeStep false;
nSolidsInDomain -1;       //Sets Upper Limit On Number Of Particles In Domain if not spcecified sets to 1000 by default



virtualMesh
{
    level 2;
    charCellSize 0.0012;
}

outputSetup
{
    basic true;
    iB  true;
    DEM false;
    addModel false;
    parallelDEM false;
}

DEM
{
    LcCoeff 0.55;
    // rotationModel chen2012;
	// rotationModel mindlin1953
    materials
    {
        particle
        {
            Y       1e7;
            nu      0.3;
            mu      0.05;
            adhN    0;
            eps     1;
        }

        wall
        {
            Y       1e7;
            nu      0.2;
            mu      0;
            adhN    0;
            eps     1;
        }
    }

    collisionPatches
    {
		wall0
		{
			material wall;
			nVec (-1.0 0.0 0.0);
			planePoint (-0.05 0.05 0.0);
		}
		wall1
		{
			material wall;
			nVec (1.0 0.0 0.0);
			planePoint (0.05 0.05 0.0);
		}
		wall2
		{
			material wall;
			nVec (0.0 0.0 1.0);
			planePoint (0 0.05 0.05);
		}

		wall3
		{
			material wall;
			nVec (0.0 0.0 -1.0);
			planePoint (0 0.05 -0.05);
		}

		wall3
		{
			material wall;
			nVec (0.0 -1.0 0.0);
			planePoint (0 0.00 0);
		}
    }
}

icoSphere
{
fullyCoupledBody;
rho         rho [1 -3 0 0 0 0 0] 7729;
U
{
	BC  noSlip;
}
material particle;
bodyGeom sphere;
sphere
{
    radius 0.0072;
    startPosition (0.0 0.162 0.0);
}
updateTorque true;
sdBasedLambda false;
interfaceSpan 1.0;
startSynced false;
refineBuffers -1;
timesToSetStatic -1; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
bodyAddition
{
	addModel once;
    onceCoeffs{}
}
}

// ************************************************************************* //
